{
    "header": {
        "projects": "Projects",
        "insights": "Insights",
        "activity-log": "Activity Log",
        "preferences": "Preferences",
        "switch-language-sl": "Switch to English",
        "switch-language-en": "Switch to Slovenian",
        "logout": "Logout"
    },
    "table": {
        "delete-selected": "Delete Selected",
        "clear-selection": "Clear Selection",
        "previous-value": "Previous value",
        "new-value": "New value",
        "close": "Close",
        "confirm": "Confirm",
        "mandatory-field": "Mandatory Field"
    },
    "activity": {
        "info": "Within each version, the Activity functionality allows you to define and track individual activities or tasks. Assign sequence numbers, names, and descriptions to activities to maintain a clear and structured workflow. By managing activities, you can ensure that every step of your process is well-defined and executed smoothly.",
        "activities": "Activities",
        "sequence-number": "Sequence number",
        "name": "Name",
        "description": "Description",
        "duration": "Estimated duration",
        "num-people": "Number of People",
        "created": "Created at",
        "updated": "Updated at",
        "bpmn-diagram": "BPMN diagram",
        "create-activity": "Create Activity",
        "delete-activity": "Delete Activity",
        "delete-activity-description": "Are you sure you want to delete activity from version?"
    },
    "version": {
        "info": "The Version functionality enables you to manage different iterations of your processes. Each version is associated with a specific process and comes with its own version number, description, duration, and other relevant details. You can easily compare and analyze different versions to ensure continuous improvement and optimize your workflows.",
        "versions": "Versions",
        "version": "Version",
        "create-version": "Create Version",
        "major": "Major",
        "minor": "Minor",
        "patch": "Patch",
        "description": "Description",
        "total-duration": "Total duration",
        "total-num-people": "Total number of people",
        "grade": "Grade",
        "created": "Created at",
        "updated": "Updated at",
        "status": "Status",
        "process": "Process",
        "delete-version": "Delete Version",
        "delete-version-description": "Are you sure you want to delete version from process?"
    },
    "process": {
        "info":"With the Process functionality, you can define and structure your workflows with ease. Create processes by specifying their name and description. Each process can have multiple versions, allowing you to make iterative improvements and track changes over time.",
        "processes": "Processes",
        "versions": "Versions",
        "project": "Project",
        "create-process": "Create Process",
        "name":"Name",
        "description": "Description",
        "num-versions": "Total number of Versions",
        "best-version": "Best Version",
        "no-best-versions": "No best versions",
        "status": "Status",
        "created": "Created at",
        "updated": "Updated at",
        "delete-process": "Delete Process",
        "delete-process-description": "Are you sure you want to delete process from project?"
    },
    "project": {
        "info": "The Project functionality allows you to create and manage your projects efficiently. Organize your work into distinct projects, each with its own name and description. Keep track of all the processes and versions associated with each project, ensuring seamless collaboration and organization.",
        "name": "Name",
        "description": "Description",
        "num-processes": "Number of processes",
        "create-project": "Create Project",
        "processes": "Processes",
        "created": "Created at",
        "updated": "Updated at",
        "delete-project": "Delete Project",
        "delete-project-description": "Are you sure you want to delete this Project?"
    },
    "activity-log": {
        "info": "The Activity Log functionality keeps a record of all activities performed within the system. It serves as an audit trail, capturing important information such as activity timestamps, user actions, and any modifications made to processes, versions, or activities. The activity log ensures transparency, accountability, and traceability, allowing you to review and track the history of actions performed within your web application.",
        "title": "Activity log for User ",
        "table-name": "Table name",
        "record": "Record",
        "action": "Action",
        "created": "Created at",
        "updated": "Updated at",
        "date": "Date"
    },
    "insights": {
        "info": "The Insights functionality provides you with valuable visual representations and analytics of your processes. Gain actionable insights into the performance, efficiency, and progress of your projects. Utilize various charts and graphs to visualize data such as process versions over time, distribution of grades or status, and other relevant metrics. These insights empower you to make data-driven decisions and optimize your workflows effectively.",
        "total_num_projects": "Total number of projects",
        "total_num_processes": "Total number of processes",
        "total_num_activities": "Total number of activities",
        "avg_processes_per_project": "Average processes per project",
        "avg_activities_per_process": "Average activities per process",
        "avg_grade_per_process": "Average grade per process",
        "avg_duration_per_process": "Average estimated time per process",
        "avg_num_people_per_process": "Average number of people per process",
        "version_max_duration": "Version with the highest estimated time",
        "version_min_duration": "Version with the smallest estimated time",
        "version_max_num_people": "Version with the most amount of poeple",
        "version_min_num_people": "Version with the least amount of poeple",
        "pie-chart-title": "Proccess status breakdown",
        "bar-chart-title": "Project breakdown",
        "process_num": "Number of processes",
        "version_num": "Number of versions",
        "project-name": "Project name",
        "process-name": "Process name",
        "version-number": "Version number"
    },
    "auth": {
        "sign-in": "Sign in",
        "email": "Email",
        "password": "password",
        "forgot-password": "Forgot password?",
        "log-in": "Log in",
        "or-sign-up": "Or sign up using ",
        "sign-up-email": "Sign up with an Email Address",
        "type-email": "Type Your Email Address here",
        "type-password": "Type your Password here",
        "sign-up": "Sign Up",
        "repeat-password": "Retype Password",
        "type-repeat-password": "Retype your Password here",
        "have-account": "Already have an Account?"
    },
    "request-errors": {
        "cannot-load": "The data could not load",
        "cannot-save": "The data could not be saved",
        "cannot-update": "The data could not be updated",
        "cannot-delete": "The data could not be deleted"
    },
    "alerts": {
        "successful-create": " successfully created.",
        "successful-update": " successfully updated.",
        "successful-delete": " successfully deleted."
    },
    "previous": "Previous",
    "next": "Next",
    "back": "Back",
    "yes": "yes",
    "no": "no",
    "search": "Search...",
    "deactivate": "Deactivate",
    "activate": "Activate",
    "changes-saved": "Changes have been saved",
    "empty-fields": "Please fill out all fields",
    "email-not-found": "Email not found",
    "email-already-registered": "Email already registered",
    "cancel": "Cancel",
    "save-changes": "Save changes",
    "create": "Create",
    "select": "Select",
    "selected": "selected",
    "finish": "Finish",
    "show-more": "Show More",
    "confirm-changes": "Confirm changes",
    "accept": "Accept",
    "decline": "Decline",
    "privacy": {
        "privacy-policy": "Privacy Policy",
        "subtitle": "Thank you for visiting University of Maribor final project website! This Privacy Policy outlines how we collect, use, disclose, and protect your personal information when you interact with our website. We are committed to ensuring the privacy and security of your personal data. Please read this policy carefully to understand our practices and how we handle your information.",
        "information-collection": "Information We Collect",
        "information-collection-description": "We may collect personal information directly from you when you voluntarily provide it while using our website. This may include but is not limited to your name, contact information, email address, and any other information you choose to provide.",
        "cookies": "Cookies and Tracking Technologies",
        "cookies-description": "We may use cookies and similar tracking technologies to enhance your browsing experience on our website. These technologies allow us to collect certain information automatically, such as your IP address, browser type, operating system, and website usage. This data helps us analyze trends, administer the site, track user movements, and gather demographic information.",
        "information-use": "Use of Information",
        "information-use-description": "We use the collected information to improve our website, provide personalized content, respond to inquiries and requests, communicate with you, and enhance your overall experience. We may also use your information for research and statistical purposes while ensuring the data remains anonymous and cannot be linked back to you.",
        "information-share": "Sharing of Information",
        "information-share-description": "We do not sell, trade, or otherwise transfer your personal information to third parties without your consent, except as described in this policy. We may share your information with trusted third-party service providers who assist us in operating our website and providing services to you. These service providers have agreed to maintain the confidentiality and security of your information.",
        "security": "Security",
        "security-description": "We take appropriate measures to protect your personal information from unauthorized access, alteration, disclosure, or destruction. We employ industry-standard security practices, such as firewalls, encryption, and secure socket layer technology (SSL), to safeguard your data. However, please be aware that no method of transmission over the internet or electronic storage is 100% secure, and we cannot guarantee absolute security.",
        "external-links": "Links to External Websites",
        "external-links-description": "Our website may contain links to external websites that are not owned or controlled by us. Please note that we are not responsible for the privacy practices of these websites. We encourage you to review their privacy policies as they may differ from ours.",
        "privacy-changes": "Changes to this Privacy Policy",
        "privacy-changes-description": "We reserve the right to update or modify this Privacy Policy at any time without prior notice. Any changes made will be effective immediately upon posting the updated policy on our website. We encourage you to review this policy periodically to stay informed about how we collect, use, and protect your information.",
        "contact": "Contact us",
        "contact-description": "If you have any questions, concerns, or requests regarding this Privacy Policy or our data practices, please contact us at olga.ivkovic@student.um.si",
        "consent": "By using our website, you consent to the terms of this Privacy Policy and the collection and use of your personal information as described herein.",
        "ensurement": "Everyone in our team is committed to maintaining the privacy and security of your personal information and will continue to review and update our practices to ensure your data is protected."
    },
    "about-us": "About Us",
    "page-not-found": "Page not found",
    "page-not-found-description":"The URL you specified was not found.",
    "positive-number": "Please enter a positive whole number",
    "number-range": "Please insert a number between 1 and 10",
    "incorrect-format": "Version format must be x.y.z",
    "active": "Active",
    "inactive": "Inactive",
    "completed": "Completed",
    "Conflict": "Already exists!",
    "export-bpmn": "Export to .BPMN",
    "go-back": "Go back",
    "welcome-text": "Welcome to OptiFlow! With our platform, you can easily create, manage, and optimize your processes. Stay organized and collaborate effectively with your team members. Track the progress of each process version, monitor the number of people involved, and ensure smooth workflow from start to finish. Gain valuable insights through powerful analytics and reporting tools. Experience efficiency and productivity like never before with our intuitive and user-friendly interface. Let's make your work easier and more enjoyable!"
}
